app/controllers/admin/categories_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def index
    @categories = Category.find(:all)

SELECT * FROM "categories" WHERE ("categories"."id" = 4)
---
  def show
    @category = Category.find(params[:id])

INSERT INTO "categories" ("created_at", "title", "updated_at", "url") VALUES('2010-08-07 09:54:16', 'test', '2010-08-07 09:54:16', 'test')
---
  def create
    @category = Category.new(params[:category])
    if @category.save

SELECT * FROM "categories" WHERE ("categories"."id" = 4)
---
  def edit
    @category = Category.find(params[:id])

SELECT * FROM "categories" WHERE ("categories"."id" = 4)
DELETE FROM "categories" WHERE "id" = 4
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy