app/controllers/admin/events_controller.rb

  def show
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 2)

  def create
    @event = Event.new(params[:event])
    if @event.save
---
INSERT INTO "events" ("type_title_show", "date_title", "time_title_show", "price", "first_name_title", "email_title", "created_at", "title", "note_title", "phone_title_show", "updated_at", "title_show", "address_title", "city_title_show", "purchaseable", "time_title", "address_title_show", "city_title", "last_name_title", "last_name_title_show", "category_ids", "category_ids_show", "note_title_show", "zipcode_title", "first_name_title_show", "email_title_show", "phone_title", "type_title", "date_title_show", "zipcode_title_show") VALUES(NULL, '', 'f', NULL, '', '', '2010-08-08 05:22:31', 'title', '', 'f', '2010-08-08 05:22:31', 'f', '', 'f', 'f', '', 'f', '', '', 'f', NULL, NULL, 'f', '', 'f', 'f', '', 'one_way', 'f', 'f')

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)

  def update
    @event = Event.find(params[:id])
    params[:event][:category_ids] ||= []
    if @event.update_attributes(params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 2)
UPDATE "events" SET "zipcode_title" = '', "updated_at" = '2010-08-08 07:02:09', "note_title_show" = 'f', "last_name_title" = '', "note_title" = '', "zipcode_title_show" = 'f', "phone_title_show" = 'f', "first_name_title" = '', "address_title" = '', "time_title_show" = 'f', "type_title" = 'one_way', "email_title_show" = 'f', "purchaseable" = 'f', "city_title_show" = 'f', "date_title" = 'Test', "last_name_title_show" = 'f', "email_title" = '', "phone_title" = '', "date_title_show" = 't', "city_title" = '', "time_title" = '', "first_name_title_show" = 'f', "address_title_show" = 'f', "title_show" = 'f' WHERE "id" = 1

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = 4)
DELETE FROM "events" WHERE "id" = 4

  def dump_csv
    @events = Event.find(:all)
    @outfile = "members_" + Time.now.strftime("%m-%d-%Y") + ".csv"

    csv_data = FasterCSV.generate do |csv|
      csv << [
      "Title",
      "Type Title",
      "Type Title Show",
      "Type Title",
      "Date Title Show",
      "Time Title",
      "Time Title Show"
      ]
      @events.each do |event|
---
SELECT * FROM "events"