app/controllers/admin/reservations_controller.rb

SELECT * FROM "reservations"
---
  def index
    @reservations = Reservation.all

SELECT * FROM "reservations" WHERE ("reservations"."id" = 1)
SELECT * FROM "events" WHERE ("events"."id" = 1)
---
  def show
    @reservation = Reservation.find(params[:id])
    @event = Event.find(@reservation.event_id)

SELECT * FROM "reservations" WHERE ("reservations"."id" = 1)
---
  def edit
    @reservation = Reservation.find(params[:id])

SELECT * FROM "reservations" WHERE ("reservations"."id" = 3)
UPDATE "reservations" SET "phone" = '', "updated_at" = '2010-08-19 23:51:59', "published" = '', "field1" = '', "email" = '', "city" = '', "zipcode" = '', "note" = '', "published_on" = '2010-08-19 23:51:00', "type_of" = '', "time" = '', "last_name" = '', "date" = '', "address" = '', "first_name" = '' WHERE "id" = 1
---
  def update
    @reservation = Reservation.find(params[:id])
    if @reservation.update_attributes(params[:reservation])

SELECT * FROM "reservations" WHERE ("reservations"."id" = 16)
DELETE FROM "reservations" WHERE "id" = 16
---
  def destroy
    @reservation = Reservation.find(params[:id])
    @reservation.destroy