app/controllers/admin/trips_controller.rb

  def index
    @trips = Trip.all
---
SELECT * FROM "trips"

  def show
    @trip = Trip.find(params[:id])
---
SELECT * FROM "trips" WHERE ("trips"."id" = 1)

  def create
    @trip = Trip.new(params[:trip])
    if @trip.save
---
INSERT INTO "trips" ("created_at", "event_id", "title", "updated_at", "date", "passengers", "published_on") VALUES('2010-08-10 06:25:40', NULL, 'test', '2010-08-10 06:25:40', 'test', 0, NULL)

  def edit
    @trip = Trip.find(params[:id])
---
SELECT * FROM "trips" WHERE ("trips"."id" = 1)

  def update
    @trip = Trip.find(params[:id])
    if @trip.update_attributes(params[:trip])
---
SELECT * FROM "trips" WHERE ("trips"."id" = 1)
UPDATE "trips" SET "updated_at" = '2010-08-10 07:47:16', "event_id" = 1, "date" = '' WHERE "id" = 1

  def destroy
    @trip = Trip.find(params[:id])
    @trip.destroy
---
SELECT * FROM "trips" WHERE ("trips"."id" = 1)
DELETE FROM "trips" WHERE "id" = 1