app/controllers/admin/users_controller.rb

  def index
    @users = User.find(:all)
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("address", "city", "created_at", "zipcode", "updated_at", "username", "password_salt", "password_hash", "email") VALUES(NULL, NULL, '2010-08-08 09:53:43', NULL, '2010-08-08 09:53:43', 'test', '0a2493a5e4898914f23e271e27b3eae0621d3e99', '4a1271654b66a5a04dcb3d7fd9dc2a503b237553', 'test@gmail.com')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-08-08 09:53:24', "username" = 'senthil111' WHERE "id" = 1