app/controllers/calenders_controller.rb

  def index
    @articles = Trip.all
---
SELECT * FROM "trips"