app/controllers/calenders_controller.rb

SELECT * FROM "reservations" WHERE ("reservations"."published" = 't' AND "reservations"."event_id" IS NULL)
---
  def index
    @event = params[:event]
    @trips = Reservation.find(:all,
            :conditions => { :event_id => @event, :published => 'true'})

SELECT * FROM "calenders" WHERE ("calenders"."id" = 1)
---
  def show
    @calender = Calender.find(params[:id])

INSERT INTO "calenders" ("created_at", "title", "updated_at", "published_on") VALUES('2010-08-10 05:58:04', 'test', '2010-08-10 05:58:04', '2010-09-09')
---
  def create
    @calender = Calender.new(params[:calender])
    if @calender.save