app/controllers/categories_controller.rb

  def index
    @categories = Category.find(:all)
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)

  def show
    @category = Category.find(params[:id])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)

  def create
    @category = Category.new(params[:category])
    if @category.save
---
INSERT INTO "categories" ("created_at", "title", "updated_at", "url") VALUES('2010-08-03 01:27:42', 'category1', '2010-08-03 01:27:42', 'url')