app/controllers/reservations_controller.rb

  def show
    @reservation = Reservation.find(params[:id])
    @event = Event.find(@reservation.event_id)
---
SELECT * FROM "reservations" WHERE ("reservations"."id" = 1)
SELECT * FROM "events" WHERE ("events"."id" = 3)

  def new
    @categories = Category.all
---
SELECT * FROM "categories"

  def create
    @categories = Category.all
    session[:reservation_params].deep_merge!(params[:reservation]) if params[:reservation] && session[:reservation_params]
    @reservation = Reservation.new(session[:reservation_params])
    if @reservation.event_id
      @event = Event.find(@reservation.event_id)
      session[:event] = @event
    else
      @event = session[:event]
    end
    @reservation.current_step = session[:reservation_step]
    if @reservation.valid?
      if params[:back_button]
        @reservation.previous_step
      elsif @reservation.last_step?
        @reservation.save if @reservation.all_valid?
---
SELECT * FROM "categories"
SELECT * FROM "events" INNER JOIN "categories_events" ON "events".id = "categories_events".event_id WHERE ("categories_events".category_id = 1 )
SELECT * FROM "reservations" WHERE ("reservations"."id" = 2)
INSERT INTO "reservations" ("address", "city", "zipcode_round", "trip_id", "created_at", "event_id", "zipcode", "field1", "published", "updated_at", "time", "city_round", "field2", "radio1", "date", "address_round", "field3", "radio2", "last_name", "phone", "note", "time_round", "date_round", "published_on", "type_of", "first_name", "email") VALUES('', '', NULL, NULL, '2010-08-19 23:59:11', 1, '', '', 'true', '2010-08-19 23:59:11', NULL, NULL, '', NULL, 'August 5, 2010 4:59 PM', NULL, '', NULL, '', '', '', NULL, NULL, '2010-08-19', 'to', '', '')

  def edit
    @reservation = Reservation.find(params[:id])
---
SELECT * FROM "reservations" WHERE ("reservations"."id" = 15)

  def update
    @reservation = Reservation.find(params[:id])
    if @reservation.update_attributes(params[:reservation])
---
SELECT * FROM "reservations" WHERE ("reservations"."id" = 1)
UPDATE "reservations" SET "updated_at" = '2010-08-08 07:38:12', "email" = '', "city" = '', "zipcode" = '', "note" = '', "time" = '2010-08-08 07:38:00', "last_name" = '', "date" = '2010-01-08', "address" = '', "first_name" = '' WHERE "id" = 1

  def destroy
    @reservation = Reservation.find(params[:id])
    @reservation.destroy
---
SELECT * FROM "reservations" WHERE ("reservations"."id" = 1)
DELETE FROM "reservations" WHERE "id" = 1

  def dump_csv
    @reservations = Reservation.all
---
SELECT * FROM "reservations"

        "Reservation note",
      ]
      @reservations.each do |reservation|
        event = Event.find(reservation.event_id)
---
SELECT * FROM "events" WHERE ("events"."id" = 1)