app/controllers/trips_controller.rb

SELECT * FROM "trips" WHERE ("trips"."id" = 3)
SELECT * FROM "events" WHERE ("events"."id" = 1)
---
  def show
    @trip = Trip.find(params[:id])
    @reservation = Reservation.new
    @event = Event.find(@trip.event_id)

INSERT INTO "reservations" ("address", "city", "zipcode_round", "trip_id", "created_at", "event_id", "zipcode", "updated_at", "time", "city_round", "date", "address_round", "last_name", "phone", "note", "time_round", "date_round", "type_of", "first_name", "email") VALUES(NULL, NULL, NULL, NULL, '2010-08-10 09:46:51', 1, NULL, '2010-08-10 09:46:51', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def reserve
    @reservation = Reservation.new(params[:'/trips/reserve'])
    @reservation.event_id = session[:event_trips]
    if @reservation.save