app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("address", "city", "created_at", "zipcode", "updated_at", "username", "password_salt", "last_name", "password_hash", "first_name", "email") VALUES(NULL, NULL, '2010-08-08 22:30:05', NULL, '2010-08-08 22:30:05', 'senthil', 'e5d4497e4f6832fa6ab05be0b2841969a4cf73b1', NULL, 'ab06180954e61cf469afc2f71f343f53fe2d3726', NULL, 'senthil196@gmail.com')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-08-08 09:37:36', "username" = 'senthil1' WHERE "id" = 1